//==================================================
//
// ゲームモード
// Author : Yuda Kaito
//
//==================================================

//==================================================
// インクルード
//==================================================
// 主要系統
#include "main.h"
#include "game.h"
#include "input.h"
#include <assert.h>
// 処理系統
#include "BG.h"
#include "particle.h"
#include "imgui_property.h"

//==================================================
// 静的変数
//==================================================
CParticle* particle;

//--------------------------------------------------
// 初期化
//--------------------------------------------------
void InitGame(void)
{
	particle = new CParticle;
	InitBg();		// 背景
	particle->Init();	// パーティクル
}

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitGame(void)
{
	UninitBg();			// 背景
	particle->Uninit();	// パーティクル
}

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdateGame(void)
{
	UpdateBg();			// 背景
	particle->Update();	// パーティクル

	if (bSetImguiParticle())
	{
		particle->Create(GetImguiParticle(), D3DXVECTOR3(SCREEN_WIDTH * 0.5f, SCREEN_HEIGHT * 0.5f, 0.0f));
	}
}

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawGame(void)
{
	DrawBg();		// 背景
	particle->Draw();	// パーティクル
}
