//**************************************************
// 
// Hackathon ( imugi_property.h )
// Author  : katsuki mizuki
// 
//**************************************************
#ifndef _IMGUI_PROPERTY_H_	// このマクロが定義されてなかったら
#define _IMGUI_PROPERTY_H_	// 2重インクルード防止のマクロ定義

//==================================================
// インクルード
//==================================================
#include "imgui.h"
#include "imgui_impl_dx9.h"
#include "imgui_impl_win32.h"
#include <d3d9.h>
#include <tchar.h>
#define IMGUI_DEFINE_MATH_OPERATORS
#include <imgui_internal.h>

#include "particle.h"

//==================================================
// プロトタイプ宣言
//==================================================
//--------------------------------------------------
// 初期化
//--------------------------------------------------
void InitImguiProperty(HWND hWnd, LPDIRECT3DDEVICE9 pDevice);

//--------------------------------------------------
// 終了
//--------------------------------------------------
void UninitImguiProperty(HWND hWnd, WNDCLASSEX wcex);

//--------------------------------------------------
// 更新
//--------------------------------------------------
void UpdateImguiProperty(void);

//--------------------------------------------------
// 描画
//--------------------------------------------------
void DrawImguiProperty(void);

//--------------------------------------------------
// 入力検知
//--------------------------------------------------
extern IMGUI_IMPL_API LRESULT ImGui_ImplWin32_WndProcHandler(HWND hWnd, UINT msg, WPARAM wParam, LPARAM lParam);

//--------------------------------------------------
// パーティクルデータの取得
//--------------------------------------------------
Particle& GetImguiParticle(void);

//--------------------------------------------------
// ファイル名の取得
//--------------------------------------------------
char* GetFileName(void);

//--------------------------------------------------
// パーティクルの使用状況取得
//--------------------------------------------------
bool bSetImguiParticle(void);



#endif // !_IMGUI_PROPERTY_H_
